

# #Зробимо функцію яка буде друкувати всі числа які входять в інпут від юзера (від 0 до числа в інпуті)
#
# def print_numbers(limit): #об'явим ф-ію із формальним параметром(параметром ф-ії)
#     for i in range(limit): #в циклі перебираємо параметр limit
#         print(i) #друкуємо її
#
#
# n = int(input("Input any number: ")) #об'являємо перемінну n з фактичним параметром(аргументом)
# print_numbers(n) #передаємо у ф-ію аргумент n
#
# # формальник параметр limit перетворюється на фактичний параметр n



# # Приклад функції для підрахування суми чисел
#
# def add_numbers(a,b):
#      return a+b
# print(add_numbers(10,50))
#
# output:
# 60


#Приклад суміщення в одну глобальну ф-ію декількох локальних

def print_numbers(limit):
    for i in range(limit):
        print(i)

def main(): #Приклад суміщення в одну глобальну ф-ію декількох локальних
    print_numbers(5)
    print("************************")
    print_numbers(10)
    print("************************")
    print_numbers(20)

main()
