#ПРИКЛАДИ ВБУДОВАНИХ ФУНКЦІЙ


# Приклад роботи вбудуваної ф-ії bin, hex, oct
a = int(input("Enter the number: "))
print("Число в 2-їчній системі: ", bin(a), sep="\t")
print("Число в 8-річній системі: ", oct(a), sep="\t")
print("Число в 16-річній системі: ", hex(a),sep="\t")
# Enter the number: 2
# Число в 2-їчній системі: 	0b10
# Число в 8-річній системі: 	0o2
# Число в 16-річній системі: 	0x2



# Приклад роботи вбудуваної ф-ії reversed - виводить послідовність в зворот. порядку

for i in reversed("abcd"):
    print(i)
# d
# c
# b
# a

# Приклад роботи вбудуваної ф-ії min і max -



