

#Зробимо функцію яка буде друкувати всі числа які входять в інпут від юзера (від 0 до числа в інпуті)

def print_numbers(limit): #об'явим ф-ію із формальним параметром(параметром ф-ії)
    for i in range(limit): #в циклі перебираємо параметр limit
        print(i) #друкуємо її


n = int(input("Input any number: ")) #об'являємо перемінну n з фактичним параметром(аргументом)
print_numbers(n) #передаємо у ф-ію аргумент n

# формальник параметр limit перетворюється на фактичний параметр n



def add_numbers(a,b): # приклад функції для підрахування суми чисел із 2 інпутів (а і b) юзера
    a = int(input("Input a: "))
    b = int(input("Input b: "))
    return a+b
print(add_numbers(1,2))

add_numbers
