
#======================================= Логические выражения ==================================================

# Логические выражения
# Во всех заданиях данной группы требуется вывести логическое значение
# TRUE, если приведенное высказывание для предложенных исходных данных
# является истинным, и значение FALSE в противном случае.
# Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.),
# считаются целыми положительными.

#======================================= boolean1 ==================================================

# Boolean1◦
# . Дано целое число A. Проверить истинность высказывания: «Число A является положительным».

def bool_1():
    a = int(input("input a: "))

    ok = a > 0

    print(ok)

#bool_1()

#======================================= boolean2 ==================================================
#
# Boolean2◦
# . Дано целое число A. Проверить истинность высказывания: «Число A является нечетным».

def bool_2():
    a = int(input("input a: "))

    ok = a % 2 != 0

    print(ok)

#bool_2()

#======================================= boolean3 ==================================================

# Boolean3◦
# . Дано целое число A. Проверить истинность высказывания: «Число A является четным».


#======================================= boolean4 ==================================================
# Boolean4◦
# . Даны два целых числа: A, B. Проверить истинность высказывания:
# «Справедливы неравенства A > 2 и B ≤ 3»

def bool_4():
    a = int(input("input a: "))
    b = int(input("input b: "))

    ok = a > 2 and b <= 3

    print(ok)

#bool_4()

#======================================= boolean5 ==================================================
# Boolean5◦
# . Даны два целых числа: A, B. Проверить истинность высказывания:
# «Справедливы неравенства A ≥ 0 или B < −2».

def bool_5():
    a = int(input("input a: "))
    b = int(input("input b: "))

    ok = a >= 0 or b < -2

    print(ok)

#bool_5()

#======================================= boolean6 ==================================================
# Boolean6◦
# . Даны три целых числа: A, B, C. Проверить истинность высказывания: «Справедливо двойное неравенство A < B < C».

def bool_6():
    a = int(input("input a: "))
    b = int(input("input b: "))
    c = int(input("input c: "))

    ok = a < b < c # тільки на пайтоні можна так писати (в усіх інших мовах буде помилка н-д: c, c++, c-sharp)
    ok = a < b and b < c #рівнозначний

    print(ok)

#bool_6()


#======================================= boolean7 ==================================================
# Boolean7◦
# . Даны три целых числа: A, B, C. Проверить истинность высказывания: «Число B находится между числами A и C».
def bool_7():
    a = int(input("input a: "))
    b = int(input("input b: "))
    c = int(input("input c: "))

    ok = a < b < c

    print(ok)

#bool_7()

#======================================= boolean8 ==================================================
# /Boolean8◦
# . Даны два целых числа: A, B. Проверить истинность высказывания:
# «Каждое из чисел A и B нечетное»

def bool_8():
    a = int(input("input a: "))
    b = int(input("input b: "))

    oka = a % 2 != 0
    okb = b % 2 != 0
    ok = oka and okb

    print(ok)

#bool_8()



#======================================= boolean9 ==================================================

# Boolean9◦
# . Даны два целых числа: A, B. Проверить истинность высказывания:
# «Хотя бы одно из чисел A и B нечетное».

def bool_8():
    a = int(input("input a: "))
    b = int(input("input b: "))

    oka = a % 2 != 0
    okb = b % 2 != 0
    ok = oka or okb

    print(ok)

#bool_8()

#======================================= boolean10 ==================================================
# Boolean10◦
# . Даны два целых числа: A, B. Проверить истинность высказывания: «Ровно одно из чисел A и B нечетное».

def bool_10():
    a = int(input("input a: "))
    b = int(input("input b: "))

    ok  = a % 2 == 0 and b % 2 != 0 or a % 2 != 0 and b % 2 == 0 #такий синтаксис не варто використовувати
    #треба декомпозувати

    #спочатку виконаються %
    #плотім <,<=,>,>=,!=,==
    #потім and
    #потім or


    print(ok)

#bool_10()
