def summ_num (first_num, sec_num, th_num):

    print(first_num + sec_num + th_num)

summ_num(12,10, 20)

"""суть ретурн це повернути якусь змінну. Н-д зберегти в якусь змінну (н-д: а або б). Ретурн може повертати лише
одну змінну(значення масив тупл). Якщо після ретурна щось написано то воно працювати не буде.

ВЗНАТИ БІЛЬШЕ ПРО РЕТУРН В ФУНКЦІЯХ

"""

"""
2) n школьников делят k яблок поровну, неделящийся остаток остается в корзинке. 
Сколько яблок достанется каждому школьнику? 
Сколько яблок останется в корзинке? 
Программа получает на вход числа n и k и должна вывести искомое количество яблок (два числа).
"""

# n = int(input("Введіть к-сть школярів: "))
# k = int(input("Введіть к-сть яблук: "))
# print(k // n)
# print("Cart", k % n)

#тема if


a = 10
b = 20
print(bool(a)) #якщо в булл буде 0, або None, пробіл, пуста стрінга --> тоді буде False. В інших випадках буде True.

"""
if elif --> 
"""
c = 20
"""
Знайти мін із 3х чисел 
"""

if a < b and a < c:
    print("Awesonmne A")
elif b < c and b < c:
    print("ksjfkf B")
else:
    print("ksjfkjnsf C")

#останню цифру можна знайти поділивши на %10
a = 1093049034
print("What number:",a / 10)
print("Last number:", a %10)
